Tekla Open API Reference for Tekla Structures 2025
MarkBase.Placing Property
 The current placing of the object. See the placing types for different placing options.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PlacingBase Placing { get; set; }
Public Property Placing As PlacingBase
	Get
	Set
Property Value
Type: PlacingBase
Implements
IPlacing.Placing
See Also
Reference
MarkBase Class
Tekla.Structures.Drawing Namespace